{"count": 11, "results": [{"id": 1, "name": "Boaring Music", "description": "If you are bored with the boars, I hear there might be something hidden in the music over in the Boaring Field. Stay a while and listen!\r\n\r\n**Find Ray Kinsella in Town of Adventure to start this quest!**\r\n\r\nYou will need `Boaring Field.ogg` from the game files.", "max_attempts": 0, "value": 50, "category": "PwnAdventure 2", "type": "standard", "hidden": false}, {"id": 2, "name": "Long live the Queen", "description": "That creepy cave is really creepy! I learned that there are messages hidden in the very sound you hear. Especially when the Spider Queen is around. Can you find out what it says?\r\n\r\n**Find Norman Osbourne in Town of Adventure to start this quest!**\r\n\r\nYou will need `Creepy Cave.wav` and `Spider Queen.wav` from the game files.", "max_attempts": 0, "value": 250, "category": "PwnAdventure 2", "type": "standard", "hidden": false}, {"id": 3, "name": "A Boaring Quest", "description": "We need the Boomstick to rid the cemetery of its evil occupants. First we must sacrifice 9800 boar hides to appease the ancient guardian protecting the Boomstick.\r\n\r\n**Find Paige Felt in North Park to start this quest!**\r\n\r\n", "max_attempts": 0, "value": 150, "category": "PwnAdventure 2", "type": "standard", "hidden": false}, {"id": 4, "name": "Cave of Nope", "description": "Four of our town members have gone missing in this cave. There must be some great evil lurking in there. And I haven't been able to find anyone brave enough to vanquish it. \r\n\r\nAre you up for it? It's dangerous but there are rumors of great treasure.\r\n\r\n**Find Pete Porker in Town of Awesome to start this quest!**", "max_attempts": 0, "value": 50, "category": "PwnAdventure 2", "type": "standard", "hidden": false}, {"id": 5, "name": "Unbearable", "description": "There is a gigantic chest full of loot in the ridge to the east of town, bu it's locked and none know where the key can be found. It's also guarded bya  large number of fierce bears. \r\n\r\nTake this chest cracker and see if you can retrieve the legendary treasure.\r\n\r\n**Find Justin Tolerable in Town of Adventure to start this quest!**", "max_attempts": 0, "value": 75, "category": "PwnAdventure 2", "type": "standard", "hidden": false}, {"id": 6, "name": "Rabbit of Caerbannog", "description": "Watch out in the ruins, there is something in there. All I saw was a bunny rabbit but my buddies are now dead, so I bravely ran away. \r\n\r\nPerhaps you should find the Holy Hand Grenade, it might be the only thing that can kill it. I'm staying here. \r\n\r\n**Find Sir Robin in Ancient Ruins to start this quest!**", "max_attempts": 0, "value": 75, "category": "PwnAdventure 2", "type": "standard", "hidden": false}, {"id": 7, "name": "Snow Down", "description": "There is a serious snow storm through here, it hasn't stopped for days! Somewhere in the storm there is a great evil lurking, because everyone we have sent has not returned. Are you willing to investigate?\r\n\r\n**Find Amorphous Bob in North Park to start this quest!**", "max_attempts": 0, "value": 250, "category": "PwnAdventure 2", "type": "standard", "hidden": false}, {"id": 8, "name": "DOS Attack", "description": "What x86 instruction has been used to allow access to extended memory without ever entering protected mode?", "max_attempts": 0, "value": 200, "category": "PwnAdventure 2", "type": "standard", "hidden": false}, {"id": 9, "name": "Ad Subtract", "description": "I hate advertisements! I'll give you a prize if you can get rid of them for me.\r\n\r\n**Find Old McDonald in Town of Awesome to start this quest!**", "max_attempts": 0, "value": 75, "category": "PwnAdventure 2", "type": "standard", "hidden": false}, {"id": 10, "name": "Moon Boots", "description": "Challenge available from within PwnAdventure2.", "max_attempts": 0, "value": 50, "category": "PwnAdventure 2", "type": "standard", "hidden": false}, {"id": 11, "name": "Portal", "description": "The Creator has left a message for us in something called The Credits. If you find what it says I'd like to hear it.\r\n\r\n**Find FlagOS in Town of Adventure to start this quest!**\r\n\r\nYou will need `credits.ogv` from the game files.", "max_attempts": 0, "value": 200, "category": "PwnAdventure 2", "type": "standard", "hidden": false}], "meta": {}}